burakenez/gd32m53x-cmake-vscode/Examples/GTOC/GTOC_closing_request_from_comparator/Application/Core/Src/system_gd32m53x.c
/*!
    \file  system_gd32m53x.c
    \brief CMSIS Cortex-M33 Device Peripheral Access Layer Source File for
           GD32M53x Device Series
*/

/*
 * Copyright (c) 2009-2018 Arm Limited. All rights reserved.
 * Copyright (c) 2026, GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* This file refers the CMSIS standard, some adjustments are made according to GigaDevice chips */

/*!
    \page    misra_violations MISRA-C:2004 violations

    \section [MISRA-C:2004]
             Violates MISRA C:2004 Rule-10.3 (Required) The value of a complex expression of integer type
             shall only be cast to a type that is not wider and of the same signedness as the underlying type of the expression.

    \section [MISRA-C:2004]
             Violates MISRA C:2004 Rule-10.4 (Required) The value of a complex expression of floating type
             shall only be cast to a floating type which is narrower or of the same size.
*/

#include "gd32m53x.h"

/* system frequency define */
#define __IRC32M          (IRC32M_VALUE)           /* internal 32 MHz RC oscillator frequency */
#define __HXTAL           (HXTAL_VALUE)            /* high speed crystal oscillator frequency */
#define __SYS_OSC_CLK     (__IRC32M)               /* main oscillator frequency */

#define VECT_TAB_OFFSET  (uint32_t)0x00            /* vector table base offset */

/* select a system clock by uncommenting the following line */
/* use IRC32M */
//#define __SYSTEM_CLOCK_IRC32M                    (uint32_t)(__IRC32M)
//#define __SYSTEM_CLOCK_24M_PLL_IRC32M            (uint32_t)(24000000)
//#define __SYSTEM_CLOCK_72M_PLL_IRC32M            (uint32_t)(72000000)
//#define __SYSTEM_CLOCK_120M_PLL_IRC32M           (uint32_t)(120000000)
//#define __SYSTEM_CLOCK_180M_PLL_IRC32M           (uint32_t)(180000000)

/* use HXTAL */
//#define __SYSTEM_CLOCK_HXTAL                     (uint32_t)(__HXTAL)
//#define __SYSTEM_CLOCK_24M_PLL_HXTAL             (uint32_t)(24000000)
//#define __SYSTEM_CLOCK_72M_PLL_HXTAL             (uint32_t)(72000000)
//#define __SYSTEM_CLOCK_120M_PLL_HXTAL            (uint32_t)(120000000)
#define __SYSTEM_CLOCK_180M_PLL_HXTAL            (uint32_t)(180000000)

/* The following is to prevent Vcore fluctuations caused by frequency switching.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
#define RCU_MODIFY_DE_2(__delay)  do{                                    \
                                      volatile uint32_t i,reg;           \
                                      if(0U != (__delay)){               \
                                          /* Insert a software delay */  \
                                          for(i=0U; i<(__delay); i++){   \
                                          }                              \
                                          reg = RCU_CFG0;                \
                                          reg &= ~(RCU_CFG0_AHBPSC);     \
                                          reg |= RCU_AHB_CKSYS_DIV2;     \
                                          /* AHB = SYSCLK/2 */           \
                                          RCU_CFG0 = reg;                \
                                          /* Insert a software delay */  \
                                          for(i=0U; i<(__delay); i++){   \
                                          }                              \
                                          reg = RCU_CFG0;                \
                                          reg &= ~(RCU_CFG0_AHBPSC);     \
                                          reg |= RCU_AHB_CKSYS_DIV4;     \
                                          /* AHB = SYSCLK/4 */           \
                                          RCU_CFG0 = reg;                \
                                          /* Insert a software delay */  \
                                          for(i=0U; i<(__delay); i++){   \
                                          }                              \
                                      }                                  \
                                  }while(0)

/* The following is to prevent Vcore fluctuations caused by frequency switching.
   It is strongly recommended to include it to avoid issues caused by self-removal. */
#define RCU_MODIFY_UP_2(__delay)  do{                                    \
                                      volatile uint32_t i,reg;           \
                                      if(0U != (__delay)){               \
                                          /* Insert a software delay */  \
                                          for(i=0U; i<(__delay); i++){   \
                                          }                              \
                                          reg = RCU_CFG0;                \
                                          reg &= ~(RCU_CFG0_AHBPSC);     \
                                          reg |= RCU_AHB_CKSYS_DIV2;     \
                                          /* AHB = SYSCLK/2 */           \
                                          RCU_CFG0 = reg;                \
                                          /* Insert a software delay */  \
                                          for(i=0U; i<(__delay); i++){   \
                                          }                              \
                                          reg = RCU_CFG0;                \
                                          reg &= ~(RCU_CFG0_AHBPSC);     \
                                          reg |= RCU_AHB_CKSYS_DIV1;     \
                                          /* AHB = SYSCLK/1 */           \
                                          RCU_CFG0 = reg;                \
                                      }                                  \
                                  }while(0)

#define SEL_IRC32M      0x00
#define SEL_HXTAL       0x01
#define SEL_PLL         0x02

/* set the system clock frequency and declare the system clock configuration function */
#ifdef __SYSTEM_CLOCK_IRC32M
uint32_t SystemCoreClock = __SYSTEM_CLOCK_IRC32M;
static void system_clock_32m_irc32m(void);
#elif defined (__SYSTEM_CLOCK_24M_PLL_IRC32M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_24M_PLL_IRC32M;
static void system_clock_24m_irc32m(void);
#elif defined (__SYSTEM_CLOCK_72M_PLL_IRC32M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_72M_PLL_IRC32M;
static void system_clock_72m_irc32m(void);
#elif defined (__SYSTEM_CLOCK_120M_PLL_IRC32M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_120M_PLL_IRC32M;
static void system_clock_120m_irc32m(void);
#elif defined (__SYSTEM_CLOCK_180M_PLL_IRC32M)
uint32_t SystemCoreClock = __SYSTEM_CLOCK_180M_PLL_IRC32M;
static void system_clock_180m_irc32m(void);

